stu_title = ['번호', '이름', '국어', '영어', '수학', '과학', '합계', '평균']
stu_datas = [
  [1, '홍길동', 100, 100, 100, 99],
  [2, '유관순', 100, 100, 100, 99],
  [3, '이순신', 100, 99, 98, 99],
  [4, '김구', 80, 100, 90, 99],
  [5, '김유신', 80, 100, 90, 99],
  ]

# for 문 
# [학생성적 프로그램]
# 번호    이름    국어    영어    수학    과학    합계    평균
# ------------------------------------------------------------
# 1       유관순  100     100     100     99      399     99.75
# 2       이순신  100     99      98      99      396     99.00
# 3       김구    80      100     90      99      369     92.25

print('               [학생성적프로그램]')
for s_t in stu_title:
  print("{}".format(s_t), end = '\t')
print() # 줄바꿈
print('-'*60)


for s in stu_datas:
  print(f"{s[0]}\t{s[1]}\t{s[2]}\t{s[3]}\t{s[4]}\t{s[5]}\t{s[2]+s[3]+s[4]+s[5]}\t{round((s[2]+s[3]+s[4]+s[5])/4, 2)}\t")