
print("{} 평균 : {:.2f}" .format("홍길동", (100+100+99)/3))

# f함수 프린트 소수점 처리 : format 적용 후 변수 전달
name = "홍길동"
avg = "{:.2f}" .format(99.6666667)
avg2 = 99.6666667
print(f"{name} 평균 : {avg}") 
print(f"{name} 평균 : {round(avg2, 2)}")






print("출력이 됩니다.")


print("""\
경북에 사는 50대 A씨는 집 근처 강에서 주말마다 낚시를 즐겼다. 
낚시로 잡은 민물고기를 그 자리에서 회를 떠서 먹는 게 그의 오랜 낙이었다. 
A씨 자녀들은 “기생충에 감염될 수 있다”며 말렸지만, 그는 “평생 먹었지만 아무 문제 없었다”며 직접 잡은 민물고기 생식을 즐겼다. 
그러다 지난해 A씨는 동네 보건소 권유로 받은 장내기생충 검사에서 간디스토마(간흡충증)라는 진단이 나왔다. 
간흡충에 감염된 상태였지만 별다른 증상이 없었다.
가만두면 암에 걸릴 수 있다는 말에 A씨는 급히 기생충 치료를 받았지만, 후유증을 걱정하게 됐다. """)






# name = "홍길동"
# num = 100
# num2 = 100
# num3 = 99
# print("%s 합계 : %d" % (name, num + num2 + num3))
# print("{} 합계 : {}" .format(name, num + num2 + num3))
# print("%s 평균 : %.2f" % (name, (num+num2+num3)/3))
# print("{} 평균 : {:.2f}" .format(name, (num+num2+num3)/3))

# # 숫자 : 12.12345 , 456.78940, 2.252525 -- 소수점 둘째자리ㅏ까지 출력

# print("소수점 둘째자리까지 : {:.2f}, {:.2f}, {:.2f}" .format(12.12345 , 456.78940, 2.252525))

# print ("\"") # \ 뒤에 잇는 문자를 문자로 인식해라
# print("안녕\n하세요")
# print("안녕\t하세요") 
# print("안녕\b 하세요") # 뒤로 하나 지움



