# 1759870
# 9870
# 590
# 동전이 몇개인지 (500, 100, 50, 10)

a = int(input("금액입력 : "))

if (a%1000)>500:
  print("500원 동전 개수 : ", (a%1000)//500)
  print("100원 동전 개수 : ", ((a%1000)%500)//100)
  print("50원 동전 개수 : ", (((a%1000)%500)%100)//50)
  print("10원 동전 개수 : ", ((((a%1000)%500)%100)%50)//10)








# str1 = input("문자를 입력하세요.")
# a = len(str1) # 문자의 길이

# if a==5:
#   print("a는 5입니다.")
# elif a==4:
#   print("a는 4입니다.")
# elif a==3:
#   print("a는 3입니다.")
# else:
#   print("a 숫자는 2 이하 입니다.")




# money = 780
# # 500 - 1
# # 100 - 2
# # 50 - 1
# # 10 - 3
# print("500원 동전개수 : ", money//500)
# print("100원 동전개수 : ", (money%500)//100)
# print("50원 동전개수 : ", (money%500)%100//50)
# print("10원 동전개수 : ", ((money%500)%100)%50//10)


# money = 1759870
# # 50000 - 35
# # 10000 -
# # 5000 -
# # 1000 -
# # 500 -
# # 100 -
# # 50 -
# # 10 -

# print("50000원권 : ", money//50000)
# print("10000원권 : ", (money%50000)//10000)
# print("5000원권 : ", ((money%50000)%10000)//5000)
# print("1000원권 : ", (((money%50000)%10000)%5000)//1000)
# print("500원권 : ", ((((money%50000)%10000)%5000)%1000)//500)
# print("100원권 : ", (((((money%50000)%10000)%5000)%1000)%500)//100)
# print("50원권 : ", ((((((money%50000)%10000)%5000)%1000)%500)%100)//50)
# print("10원권 : ", (((((((money%50000)%10000)%5000)%1000)%500)%100)%50)//10)

